app/views/orders/_form.html.erb

    -->
      <h2><%= t('errors.template.header', :count=>@order.errors.size,
                :model=>t('activerecord.models.order')) %>.</h2>
---
SELECT "orders".* FROM "orders" WHERE "orders"."id" = ? LIMIT 1  [["id", "980190962"]]