app/controllers/admin_controller.rb

SELECT COUNT(*) FROM "orders"
---
  def index
    #Find out the total orders and pass it to admin index view page
    @total_orders = Order.count