app/controllers/line_items_controller.rb

SELECT "products".* FROM "products" WHERE "products"."id" = ? ORDER BY title LIMIT 1  [["id", "207281424"]]
INSERT INTO "carts" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", Tue, 31 Jul 2012 09:39:56 UTC +00:00], ["updated_at", Tue, 31 Jul 2012 09:39:56 UTC +00:00]]
INSERT INTO "line_items" ("cart_id", "created_at", "order_id", "product_id", "quantity", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["cart_id", 980190963], ["created_at", Thu, 02 Aug 2012 10:19:26 UTC +00:00], ["order_id", nil], ["product_id", 207281424], ["quantity", 1], ["updated_at", Thu, 02 Aug 2012 10:19:26 UTC +00:00]]
---
  def create
    #Now let’s modify the LineItemsController to find the shopping cart for the current
    #session (creating one if there isn’t one there already), add the selected product
    #to that cart, and display the cart contents.

    # Line item will be created from adding Product to the Cart
    #@line_item = LineItem.new(params[:line_item])

    #current_cart is the function/method define n the ApplicationController
    @cart = current_cart
    product = Product.find(params[:product_id])
=begin
    We then pass that product we found into @cart.line_items.build. This causes a
    new line item relationship to be built between the @cart object and the product.
    You can build the relationship from either end, and Rails will take care of
    establishing the connections on both sides.

=end
    # *** Here :product_id reference the cart product_id. So that we an find out the specific product from the cart
    #@line_item = @cart.line_items.build(:product_id => product)
    #p("Product Id : "+product.id)
    @line_item = @cart.add_product(product.id)

    respond_to do |format|
      if @line_item.save