app/controllers/orders_controller.rb

SELECT "orders".* FROM "orders" ORDER BY created_at desc LIMIT 10 OFFSET 0
---
  def index
    #@orders = Order.all
    #Load order by using pagination . After installing gem bundle u have to restart the server again
    @orders = Order.paginate :page=>params[:page], :order=>'created_at desc',
                             :per_page => 10

INSERT INTO "carts" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", Thu, 02 Aug 2012 11:23:28 UTC +00:00], ["updated_at", Thu, 02 Aug 2012 11:23:28 UTC +00:00]]
INSERT INTO "orders" ("address", "created_at", "email", "id", "name", "pay_type", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
DELETE FROM "carts" WHERE "carts"."id" = ?  [["id", 980190963]]
SELECT "line_items".* FROM "line_items" WHERE "line_items"."order_id" = 980190963
---
  def create
    @order = Order.new(params[:order])
    #When an order s created it will add the line items with the order
    @order.add_line_items_from_cart(current_cart)

    respond_to do |format|
      if @order.save
        #format.html { redirect_to @order, :notice => 'Order was successfully created.' }
        # Destroy the cart with the session id
        Cart.destroy(session[:cart_id])
        session[:cart_id] = nil
        # When creating an order
        Notifier.order_received(@order).deliver