app/controllers/products_controller.rb

SELECT "products".* FROM "products" WHERE "products"."id" = ? ORDER BY title LIMIT 1  [["id", "980190962"]]
---
  def show
    @product = Product.find(params[:id])

SELECT "products".* FROM "products" WHERE "products"."id" = ? ORDER BY title LIMIT 1  [["id", "980190962"]]
---
  def edit
    @product = Product.find(params[:id])

SELECT "products".* FROM "products" WHERE "products"."id" = ? ORDER BY title LIMIT 1  [["id", "980190962"]]
UPDATE "products" SET "updated_at" = '2012-08-06 08:21:41.557185', "image_url" = 'lorem.jpg', "price" = 19.95, "description" = 'Wibbles are fun!', "title" = 'Lorem Ipsum' WHERE "products"."id" = 980190962
---
  def update
    @product = Product.find(params[:id])

    respond_to do |format|
      if @product.update_attributes(params[:product])

SELECT "products".* FROM "products" WHERE "products"."id" = ? ORDER BY title LIMIT 1  [["id", "980190962"]]
DELETE FROM "products" WHERE "products"."id" = ?  [["id", 980190962]]
---
  def destroy
    @product = Product.find(params[:id])
    @product.destroy