app/controllers/store_controller.rb

  def index
    # It is used to load all of our products
    #@products = Product.all

    #Now we have to make a small change to the store controller. We’re invoking
    #the layout while looking at the store’s index action, and that action doesn’t
    #currently set @cart.

    #@cart = current_cart

    if params[:set_locale]
      redirect_to store_path(:locale => params[:set_locale])
    else
      @products = Product.all
---
SELECT "products".* FROM "products" ORDER BY title