app/controllers/users_controller.rb

  def index
    #@users = User.all
    #Let’s also order the users returned in the index by name:
    @users = User.order(:name)
---
SELECT "users".* FROM "users" ORDER BY name

  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("created_at", "hashed_password", "name", "salt", "updated_at") VALUES (?, ?, ?, ?, ?)

  def update
    @user = User.find(params[:id])

    respond_to do |format|
      if @user.update_attributes(params[:user])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "980190962"]]
UPDATE "users" SET "salt" = '-6119123580.0927479472403863', "hashed_password" = 'e922217ab5bbaddcb25fde2f37e1995c05a66be84fd9f68944f96eeb03baf800', "name" = 'sam', "updated_at" = '2012-08-06 04:08:39.446016' WHERE "users"."id" = 980190962

  def destroy
    @user = User.find(params[:id])
    #@user.destroy
    begin
      @user.destroy
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "980190962"]]
DELETE FROM "users" WHERE "users"."id" = ?  [["id", 980190962]]